In [2]:
from operator import index
import pandas as pd
import numpy as np
pilas="data_filt.csv"
df = pd.read_csv(pilas, encoding = 'latin1')
df

       ch06           nivel_ed  htot            calif     p47t
0        46        1_H/Sec inc    45  2_Op./No calif.   6000.0
1        26  2_Sec. comp y más    25  2_Op./No calif.   5000.0
2        47  2_Sec. comp y más    25  2_Op./No calif.   5000.0
3        52        1_H/Sec inc    90  2_Op./No calif.  11000.0
4        45        1_H/Sec inc    44  2_Op./No calif.   9500.0
...     ...                ...   ...              ...      ...
23443    45  2_Sec. comp y más    50  2_Op./No calif.   4000.0
23444    58        1_H/Sec inc    30  2_Op./No calif.   5000.0
23445    36  2_Sec. comp y más    40  2_Op./No calif.  13000.0
23446    49        1_H/Sec inc    40  2_Op./No calif.   4000.0
23447    36        1_H/Sec inc    54  2_Op./No calif.   8000.0

[23448 rows x 5 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23448 entries, 0 to 23447
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ch06      23448 non-null  int64
 1   nivel_ed  23448 non-null  object
 2   htot      23448 non-null  int64
 3   calif     23448 non-null  object
 4   p47t      23448 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 916.1+ KB

In [5]:
df["ch06"]

0        46
1        26
2        47
3        52
4        45
         ..
23443    45
23444    58
23445    36
23446    49
23447    36
Name: ch06, Length: 23448, dtype: int64

In [8]:
df.columns

Index(['ch06', 'nivel_ed', 'htot', 'calif', 'p47t'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=23448, step=1)

In [14]:
df["calif"].dtype

dtype('O')

In [16]:
df["nivel_ed"].value_counts()

2_Sec. comp y más    14634
1_H/Sec inc           8814
Name: nivel_ed, dtype: int64

In [17]:
df["calif"].value_counts()

2_Op./No calif.    17372
1_Prof./Tecn.       6076
Name: calif, dtype: int64

In [20]:
df["p47t"].sum()

190114176.0

In [22]:
df["p47t"].mean()

8107.905834186285

In [7]:
df[["nivel_ed","p47t"]]

                nivel_ed     p47t
0            1_H/Sec inc   6000.0
1      2_Sec. comp y más   5000.0
2      2_Sec. comp y más   5000.0
3            1_H/Sec inc  11000.0
4            1_H/Sec inc   9500.0
...                  ...      ...
23443  2_Sec. comp y más   4000.0
23444        1_H/Sec inc   5000.0
23445  2_Sec. comp y más  13000.0
23446        1_H/Sec inc   4000.0
23447        1_H/Sec inc   8000.0

[23448 rows x 2 columns]

In [27]:
df2[:21]

             nivel_ed     p47t
0         1_H/Sec inc   6000.0
1   2_Sec. comp y más   5000.0
2   2_Sec. comp y más   5000.0
3         1_H/Sec inc  11000.0
4         1_H/Sec inc   9500.0
5   2_Sec. comp y más   6000.0
6   2_Sec. comp y más   9000.0
7         1_H/Sec inc   4260.0
8         1_H/Sec inc   3800.0
9   2_Sec. comp y más  10517.0
10        1_H/Sec inc   8300.0
11  2_Sec. comp y más   4900.0
12  2_Sec. comp y más  11000.0
13  2_Sec. comp y más   9000.0
14        1_H/Sec inc   3500.0
15        1_H/Sec inc   8000.0
16        1_H/Sec inc   2500.0
17        1_H/Sec inc   7500.0
18        1_H/Sec inc   5000.0
19        1_H/Sec inc   5500.0
20  2_Sec. comp y más   7000.0

In [28]:
df.sample(500)

       ch06           nivel_ed  htot            calif     p47t
19368    23  2_Sec. comp y más    40  2_Op./No calif.   6000.0
20352    26  2_Sec. comp y más    40    1_Prof./Tecn.   7500.0
6332     42  2_Sec. comp y más    48  2_Op./No calif.   9700.0
18759    28  2_Sec. comp y más    64  2_Op./No calif.  11200.0
18244    23  2_Sec. comp y más    20  2_Op./No calif.   1200.0
...     ...                ...   ...              ...      ...
12787    48        1_H/Sec inc    20  2_Op./No calif.   1800.0
13907    57  2_Sec. comp y más    44    1_Prof./Tecn.   8000.0
4696     22  2_Sec. comp y más    25  2_Op./No calif.   4000.0
13834    26  2_Sec. comp y más    35  2_Op./No calif.   5000.0
728      38        1_H/Sec inc    25  2_Op./No calif.   6500.0

[500 rows x 5 columns]

In [8]:
df.describe()

               ch06          htot           p47t
count  23448.000000  23448.000000   23448.000000
mean      40.455689     39.684536    8107.905834
std       12.934870     16.172226    6396.801309
min       12.000000      1.000000      80.000000
25%       30.000000     30.000000    4000.000000
50%       39.000000     40.000000    7000.000000
75%       50.000000     48.000000   10000.000000
max       93.000000    168.000000  130000.000000

In [4]:
pro=df[["htot","p47t"]]
pro

       htot     p47t
0        45   6000.0
1        25   5000.0
2        25   5000.0
3        90  11000.0
4        44   9500.0
...     ...      ...
23443    50   4000.0
23444    30   5000.0
23445    40  13000.0
23446    40   4000.0
23447    54   8000.0

[23448 rows x 2 columns]

In [6]:
horas=np.mean(pro["htot"])
horas

39.684535994541115

In [9]:
sueldo=np.mean(pro["p47t"])
sueldo

8107.905834186285

In [11]:
proH=pro["htot"].describe()
proH

count    23448.000000
mean        39.684536
std         16.172226
min          1.000000
25%         30.000000
50%         40.000000
75%         48.000000
max        168.000000
Name: htot, dtype: float64

In [13]:
pro["htot"<48]

TypeError: '<' not supported between instances of 'str' and 'int'